app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."client_id" = $1 ORDER BY id LIMIT 5 OFFSET 0  [["client_id", 2]]
SELECT COUNT(*) FROM "accounts" WHERE "accounts"."client_id" = $1  [["client_id", 2]]
---
  def index
    @accounts = @client.accounts.order('id').page(params[:page])

INSERT INTO "accounts" ("client_id", "created_at", "number", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["client_id", 1], ["created_at", Sun, 26 May 2013 01:45:14 UTC +00:00], ["number", 29571903], ["updated_at", Sun, 26 May 2013 01:45:14 UTC +00:00]]
---
  def create
    @client.accounts.create!

DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 2]]
---
  def destroy
    @account.destroy

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def find_client
      @client = Client.find(params[:client_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."client_id" = $1 AND "accounts"."id" = $2 LIMIT 1  [["client_id", 1], ["id", "2"]]
---
    def find_account
      @account = @client.accounts.find(params[:id])