app/controllers/clients_controller.rb

  def index
    @clients = Client.all.page(params[:page])
---
SELECT "clients".* FROM "clients" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "clients"

  def create
    @client = Client.new(client_params)

    if @client.save
---
INSERT INTO "clients" ("created_at", "email", "name", "password_digest", "phone", "surname", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"