app/controllers/sessions_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."email" = 'ala@wp.pl' LIMIT 1
---
  def create
    client = Client.find_by_email(params[:email])