app/controllers/transactions_controller.rb

  def index
    @transactions = @account.transactions.order('id desc').page(params[:page])
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."account_id" = $1 ORDER BY id desc LIMIT 2 OFFSET 0  [["account_id", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."account_id" = $1  [["account_id", 3]]

  def create
    @transaction = @account.transactions.new(transaction_params)
    if @transaction.save
---
INSERT INTO "transactions" ("account_id", "amount", "created_at", "descr", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 3], ["amount", 100], ["created_at", Mon, 27 May 2013 11:48:52 UTC +00:00], ["descr", "test"], ["updated_at", Mon, 27 May 2013 11:48:52 UTC +00:00]]

    def find_account
      @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 ORDER BY "accounts"."id" ASC LIMIT 1  [["id", 3]]